#dict preloaded
alphabet={".-":'a',"-...":'b',"-.-.":'c',"-..":'d',".":'e',"..-.":'f',"--.":'g',"....":'h',"..":'i',".---":'j',
"-.-":'k',".-..":'l',"--":'m',"-.":'n',"---":'o',".--.":'p',"--.-":'q',".-.":'r',"...":'s',"-":'t',"..-":'u',"...-":'v',
".--":'w',"-..-":'x',"-.--":'y',"--..":'z',".----":'1',"..---":'2',"...--":'3',"....-":'4',".....":'5',"-....":'6',
"--...":'7',"---..":'8',"----.":'9',"-----":'0',"":" "}

def decode(string):
    string = string.split(" ") #分割
    result = "" #空白字串

    if string == ['']: #避開空白清單
        return ""
    else:
        for i in string:
            result += alphabet[i] #解碼
        return result

#測試
print(decode(".... . .-.. .-.. ---  .-- --- .-. .-.. -.."))			#, "hello world")
print(decode(".---- ... -  .- -. -..  ..--- -. -.."))					#, "1st and 2nd")
print(decode("..  .- --  .-  - . ... -"))								#, "i am a test")
# print(decode(".- -... -.-. -.. . ..-. --. .... .. .--- -.- .-.. -- -. --- .--. --.- .-. ... - ..- ...- .-- -..- -.-- --.. ----- .---- ..--- ...-- ....- ..... -.... --... ---.. ----."))					#,"abcdefghijklmnopqrstuvwxyz0123456789", "Double-check that you cover the entire required alphabet")
print(decode(""))														#, "")